**Plan Results**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_budgets_budget.account_budget will be created
+   resource "aws_budgets_budget" "account_budget" {
+       account_id        = (known after apply)
+       arn               = (known after apply)
+       budget_type       = "COST"
+       cost_filters      = (known after apply)
+       id                = (known after apply)
+       limit_amount      = "50"
+       limit_unit        = "USD"
+       name              = "monthly_account_budget"
+       name_prefix       = (known after apply)
+       time_period_end   = "2050-08-01_00:00"
+       time_period_start = "2022-08-01_00:00"
+       time_unit         = "MONTHLY"

+       cost_filter {
+           name   = (known after apply)
+           values = (known after apply)
        }

+       cost_types {
+           include_credit             = (known after apply)
+           include_discount           = (known after apply)
+           include_other_subscription = (known after apply)
+           include_recurring          = (known after apply)
+           include_refund             = (known after apply)
+           include_subscription       = (known after apply)
+           include_support            = (known after apply)
+           include_tax                = (known after apply)
+           include_upfront            = (known after apply)
+           use_amortized              = (known after apply)
+           use_blended                = (known after apply)
        }

+       notification {
+           comparison_operator        = "EQUAL_TO"
+           notification_type          = "ACTUAL"
+           subscriber_email_addresses = [
+               "jacobnosal@gmail.com",
            ]
+           subscriber_sns_topic_arns  = []
+           threshold                  = 80
+           threshold_type             = "PERCENTAGE"
        }
+       notification {
+           comparison_operator        = "GREATER_THAN"
+           notification_type          = "ACTUAL"
+           subscriber_email_addresses = [
+               "jacobnosal@gmail.com",
            ]
+           subscriber_sns_topic_arns  = []
+           threshold                  = 100
+           threshold_type             = "PERCENTAGE"
        }
+       notification {
+           comparison_operator        = "GREATER_THAN"
+           notification_type          = "FORECASTED"
+           subscriber_email_addresses = [
+               "jacobnosal@gmail.com",
            ]
+           subscriber_sns_topic_arns  = []
+           threshold                  = 100
+           threshold_type             = "PERCENTAGE"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   budget_arn = (known after apply)
+   budget_id  = (known after apply)
```